belt_exam_rails/app/controllers/groups_controller.rb

SELECT  "organisations".* FROM "organisations"  WHERE "organisations"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "organisations".* FROM "organisations"
INSERT INTO "groups" ("created_at", "updated_at", "user_id") VALUES (?, ?, ?)  [["created_at", "2016-08-26 19:42:23.201969"], ["updated_at", "2016-08-26 19:42:23.201969"], ["user_id", 2]]
---
  def index
		@organisation = Organisation.find(params[:id])
		@user = User.find(current_user)

		@group = Organisation.all
		@organisation_id = Organisation.find(params[:id])
		group_create = Group.create(user: current_user, organisation: params[:organisation_id])