belt_exam_rails/app/controllers/organisations_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "organisations" ("created_at", "description", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2016-08-26 17:44:03.344204"], ["description", "rails developer"], ["name", "ruby on rails"], ["updated_at", "2016-08-26 17:44:03.344204"], ["user_id", 1]]
---
  def create
  	@user = User.find(params[:id])
  	@organisation = Organisation.create(name: params[:name], description: params[:description] , user_id: params[:user_id] )