belt_exam_rails/app/controllers/users_controller.rb

  def create
    @user = User.create(user_params)
---
INSERT INTO "users" ("created_at", "email", "first_name", "last_name", "location", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def show
    @user = User.find(params[:id])
    @details = Organisation.all
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 11]]
SELECT "organisations".* FROM "organisations"